trade_exp/src/Catalogs/НормативыПриемкиПоставкиНаСклад/НормативыПриемкиПоставкиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ea4d25a2-fd34-478b-ac1f-41280c7f82a0">
  <name>НормативыПриемкиПоставкиНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d5a4e800-74ca-4f1f-85b6-3378c2418553">
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ee92f60a-cc0c-43d3-ba10-3e4d79aeb43a">
    <name>Норматив</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc0025e2-7e5a-4991-9ce5-0655df6a9cfd">
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fc30e00e-b96c-4335-9cd6-9c2650e242d8">
    <name>ЕдИзмеренияЗнаменателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="56fe706d-a326-4c34-8359-2e3c95d3f37c">
    <name>МинимальноеВремя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="204bd569-c1c8-49c4-8715-55f3a2f5c878">
    <name>МаксимальноеВремя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c42be1c4-6ddf-4962-b87e-80ad3ae26a8b">
    <name>ДополнительноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0c81436b-2e9f-4200-aea6-7d70e3c7f473">
      <name>ТребуемоеКоличество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="940e18af-cdb4-4654-b071-4fed8827b484">
      <name>Ресурс</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes extendedConfigurationObject="fe815fb5-1875-4130-acf3-35d54b6300d2">
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57ed9ee0-517f-4fb9-bc74-2d8fcd4d0a4b">
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4dc73fe7-64ac-43ce-ab0c-df92d01c6311">
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e0d07478-37ac-42f6-a26a-04f4fa4c4743">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebb5bfee-de18-4d14-a24f-e32cbdd90cf9">
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23aae39e-0410-48bc-917a-96177b6e468b">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7f52563-0c7c-4de6-ac07-6ef01ff7688d">
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35306e02-2ad1-4232-a398-068a769610be">
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be5c2342-1fad-40cf-b4f7-a1017bc7e542">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af87b08a-d7f9-4ad8-9eec-e3f927c89172">
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df4a78ba-9180-411a-943d-2eaf96f21d69">
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba8289fe-be8a-45a4-819c-2c2f84c4de2f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5aa38e35-acdf-4eae-a145-4407937beec7">
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f74a4575-a405-4411-b8a1-f7dda30e2967">
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="922b22b5-b814-4d15-b669-ded6f1e11a61">
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7304712c-4a4e-40e0-be6c-a895e78d8825">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f2cd6a4-d354-43cb-b6e5-9f43829d8bc3">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b61ba6a-896e-4ef0-98cc-bb012362f16c">
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1306a2c8-039b-4b1b-a808-f8fc27b47f72">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0192ca1-e274-4de7-a7bd-ffca9512f173">
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c40dec99-d7f0-45f7-94f9-5288383ea7f7">
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="993b535f-c665-4cc4-b466-d11667bec4fa">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4378e490-1e5e-4dd6-a3db-03d426ec7986">
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/НормативыПриемкиПоставкиНаСклад/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЧислительПриИзменении(Элемент)
	ПересчитатьНорматив();
КонецПроцедуры

&НаКлиенте
Процедура ЗнаменательПриИзменении(Элемент)
	ПересчитатьНорматив();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНорматив()
	Если Объект.Знаменатель <>0 Тогда
		Объект.Норматив = Объект.Числитель/Объект.Знаменатель;
	КонецЕсли;
КонецПроцедуры // ПересчитатьНорматив()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЕдиницИзмерения = Объект.ЕдИзмеренияЗнаменателя.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура СписокЕдиницИзмеренияПриИзменении(Элемент)
	Объект.ЕдИзмеренияЗнаменателя = ПолучитьЕдиницуИзмерениСервер(СписокЕдиницИзмерения);
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерениСервер(Наименование)

	 Возврат Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Наименование);

КонецФункции // ПолучитьЕдиницуИзмерениСервер()
